R3b3lAllianc3/FreeRTOS-nRF9160/FreeRTOSDemo_s/Nordic_Code/mdk/gcc_cmsis5_startup_nrf9160.c
//*****************************************************************************
// LPC55S69_cm33_core0 startup code for use with MCUXpresso IDE
//
// Version : 220119
//*****************************************************************************
//
// Copyright 2016-2019 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void SPU_IRQHandler(void);
WEAK void CLOCK_POWER_IRQHandler(void);
WEAK void UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQHandler(void);
WEAK void UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQHandler(void);
WEAK void UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_IRQHandler(void);
WEAK void UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_IRQHandler(void);
WEAK void GPIOTE0_IRQHandler(void);
WEAK void SAADC_IRQHandler(void);
WEAK void TIMER0_IRQHandler(void);
WEAK void TIMER1_IRQHandler(void);
WEAK void TIMER2_IRQHandler(void);
WEAK void RTC0_IRQHandler(void);
WEAK void RTC1_IRQHandler(void);
WEAK void WDT_IRQHandler(void);
WEAK void EGU0_IRQHandler(void);
WEAK void EGU1_IRQHandler(void);
WEAK void EGU2_IRQHandler(void);
WEAK void EGU3_IRQHandler(void);
WEAK void EGU4_IRQHandler(void);
WEAK void EGU5_IRQHandler(void);
WEAK void PWM0_IRQHandler(void);
WEAK void PWM1_IRQHandler(void);
WEAK void PWM2_IRQHandler(void);
WEAK void PWM3_IRQHandler(void);
WEAK void PDM_IRQHandler(void);
WEAK void I2S_IRQHandler(void);
WEAK void IPC_IRQHandler(void);
WEAK void FPU_IRQHandler(void);
WEAK void GPIOTE1_IRQHandler(void);
WEAK void KMU_IRQHandler(void);
WEAK void CRYPTOCELL_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void SPU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CLOCK_POWER_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIOTE0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAADC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TIMER0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TIMER1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TIMER2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EGU5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWM3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I2S_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void IPC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FPU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIOTE1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void KMU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CRYPTOCELL_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
//*****************************************************************************
// External declaration for LPC MCU vector table checksum from  Linker Script
//*****************************************************************************
WEAK extern void __valid_user_code_checksum();

//*****************************************************************************
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM33
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    __valid_user_code_checksum,        // LPC MCU checksum
    0,                                 // ECRP
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

