R3b3lAllianc3/FreeRTOS-nRF9160/FreeRTOSDemo_s/Nordic_Code/mdk/gcc_cmsis5_startup_nrf9160.c
    // Chip Level - nRF9160 - core0
	0,                            //Reserved
	0,                            //Reserved
	0,                            //Reserved
	SPU_IRQHandler,
	0,                           //Reserved
	CLOCK_POWER_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQHandler,
	UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQHandler,
	UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_IRQHandler,
	UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_IRQHandler,
	0,                          //Reserved
	GPIOTE0_IRQHandler,
	SAADC_IRQHandler,
	TIMER0_IRQHandler,
	TIMER1_IRQHandler,
	TIMER2_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	RTC0_IRQHandler,
	RTC1_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	WDT_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	EGU0_IRQHandler,
	EGU1_IRQHandler,
	EGU2_IRQHandler,
	EGU3_IRQHandler,
	EGU4_IRQHandler,
	EGU5_IRQHandler,
	PWM0_IRQHandler,
	PWM1_IRQHandler,
	PWM2_IRQHandler,
	PWM3_IRQHandler,
	0,                           //Reserved
	PDM_IRQHandler,
	0,                         //Reserved
	I2S_IRQHandler,
	0,                           //Reserved
	IPC_IRQHandler,
	0,                           //Reserved
	FPU_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	GPIOTE1_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	KMU_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	CRYPTOCELL_IRQHandler,
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved
	0,                           //Reserved

}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

