R3b3lAllianc3/FreeRTOS-nRF9160/FreeRTOSDemo_s/Nordic_Code/mdk/gcc_cmsis5_startup_nrf9160.c
    // Load base address of Global Section Table
    SectionTableAddr = &__data_section_table;

    // Copy the data sections from flash to SRAM.
    while (SectionTableAddr < &__data_section_table_end) {
        LoadAddr = *SectionTableAddr++;
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        data_init(LoadAddr, ExeAddr, SectionLen);
    }

    // At this point, SectionTableAddr = &__bss_section_table;
    // Zero fill the bss segment
    while (SectionTableAddr < &__bss_section_table_end) {
        ExeAddr = *SectionTableAddr++;
        SectionLen = *SectionTableAddr++;
        bss_init(ExeAddr, SectionLen);
    }


#if !defined (__USE_CMSIS)
// Assume that if __USE_CMSIS defined, then CMSIS SystemInit code
// will setup the VTOR register

    // Check to see if we are running the code from a non-zero
    // address (eg RAM, external flash), in which case we need
    // to modify the VTOR register to tell the CPU that the
    // vector table is located at a non-0x0 address.
    unsigned int * pSCB_VTOR = (unsigned int *) 0xE000ED08;
    if ((unsigned int *)g_pfnVectors!=(unsigned int *) 0x00000000) {
        *pSCB_VTOR = (unsigned int)g_pfnVectors;
    }
#endif // (__USE_CMSIS)
#if defined (__cplusplus)
    //
    // Call C++ library initialisation
    //
    __libc_init_array();
#endif

    // Reenable interrupts
    __asm volatile ("cpsie i");

#if defined (__REDLIB__)
    // Call the Redlib library, which in turn calls main()
    __main();
#else
    main();
#endif

    //
    // main() shouldn't return, but if it does, we'll just enter an infinite loop
    //
    while (1) {
        ;
    }
}

//*****************************************************************************
// Default core exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
WEAK_AV void NMI_Handler(void)
{ while(1) {}
}

WEAK_AV void HardFault_Handler(void)
{ while(1) {}
}

WEAK_AV void MemManage_Handler(void)
{ while(1) {}
}

WEAK_AV void BusFault_Handler(void)
{ while(1) {}
}

WEAK_AV void UsageFault_Handler(void)
{ while(1) {}
}

WEAK_AV void SVC_Handler(void)
{ while(1) {}
}

WEAK_AV void DebugMon_Handler(void)
{ while(1) {}
}

WEAK_AV void PendSV_Handler(void)
{ while(1) {}
}

WEAK_AV void SysTick_Handler(void)
{ while(1) {}
}

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void IntDefaultHandler(void)
{ while(1) {}
}

//*****************************************************************************
// Default application exception handlers. Override the ones here by defining
// your own handler routines in your application code. These routines call
// driver exception handlers or IntDefaultHandler() if no driver exception
// handler is included.
//*****************************************************************************
WEAK void SPU_IRQHandler(void)
{   SPU_DriverIRQHandler();
}

WEAK void CLOCK_POWER_IRQHandler(void)
{   CLOCK_POWER_DriverIRQHandler();
}

WEAK void UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_IRQHandler(void)
{   UARTE0_SPIM0_SPIS0_TWIM0_TWIS0_DriverIRQHandler();
}

WEAK void UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_IRQHandler(void)
{   UARTE1_SPIM1_SPIS1_TWIM1_TWIS1_DriverIRQHandler();
}

WEAK void UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_IRQHandler(void)
{   UARTE2_SPIM2_SPIS2_TWIM2_TWIS2_DriverIRQHandler();
}

WEAK void UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_IRQHandler(void)
{   UARTE3_SPIM3_SPIS3_TWIM3_TWIS3_DriverIRQHandler();
}

WEAK void GPIOTE0_IRQHandler(void)
{   GPIOTE0_DriverIRQHandler();
}

WEAK void SAADC_IRQHandler(void)
{   SAADC_DriverIRQHandler();
}

WEAK void TIMER0_IRQHandler(void)
{   TIMER0_DriverIRQHandler();
}

WEAK void TIMER1_IRQHandler(void)
{   TIMER1_DriverIRQHandler();
}

WEAK void TIMER2_IRQHandler(void)
{   TIMER2_DriverIRQHandler();
}

WEAK void RTC0_IRQHandler(void)
{   RTC0_DriverIRQHandler();
}

WEAK void RTC1_IRQHandler(void)
{   RTC1_DriverIRQHandler();
}

WEAK void WDT_IRQHandler(void)
{   WDT_DriverIRQHandler();
}

WEAK void EGU0_IRQHandler(void)
{   EGU0_DriverIRQHandler();
}

WEAK void EGU1_IRQHandler(void)
{   EGU1_DriverIRQHandler();
}

WEAK void EGU2_IRQHandler(void)
{   EGU2_DriverIRQHandler();
}

WEAK void EGU3_IRQHandler(void)
{   EGU3_DriverIRQHandler();
}

WEAK void EGU4_IRQHandler(void)
{   EGU4_DriverIRQHandler();
}

WEAK void EGU5_IRQHandler(void)
{   EGU5_DriverIRQHandler();
}

WEAK void PWM0_IRQHandler(void)
{   PWM0_DriverIRQHandler();
}

WEAK void PWM1_IRQHandler(void)
{   PWM1_DriverIRQHandler();
}

WEAK void PWM2_IRQHandler(void)
{   PWM2_DriverIRQHandler();
}

WEAK void PWM3_IRQHandler(void)
{   PWM3_DriverIRQHandler();
}

WEAK void PDM_IRQHandler(void)
{   PDM_DriverIRQHandler();
}

WEAK void I2S_IRQHandler(void)
{   I2S_DriverIRQHandler();
}

WEAK void IPC_IRQHandler(void)
{   IPC_DriverIRQHandler();
}

WEAK void FPU_IRQHandler(void)
{   FPU_DriverIRQHandler();
}

WEAK void GPIOTE1_IRQHandler(void)
{   GPIOTE1_DriverIRQHandler();
}

WEAK void KMU_IRQHandler(void)
{   KMU_DriverIRQHandler();
}

WEAK void CRYPTOCELL_IRQHandler(void)
{   CRYPTOCELL_DriverIRQHandler();
}
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
